### Data cleaning:  IMDB- title.crew
The following codes merges director names in imdb.name.basics and director ids in imdb.title.crew 

Name of clean datasets: 
"df_directors_wide" and "df_directors_long"

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

### Step 1: Clearning imdb.title.crew

In [2]:
# Read original data
df_title_crew = pd.read_csv('Data/zippedData/imdb.title.crew.csv.gz')
df_title_crew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   tconst     146144 non-null  object
 1   directors  140417 non-null  object
 2   writers    110261 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

In [3]:
df_title_crew.sample(5)

            tconst  directors                        writers
22566    tt3440246  nm0521730            nm0407794,nm0316044
123727  tt10003008  nm2002649            nm2002649,nm1846132
10985    tt1583341  nm3764047            nm3950333,nm3763597
36261    tt8065364  nm5036068  nm5036068,nm8360170,nm9605799
94299    tt9811610  nm2353478                            NaN

In [4]:
# Make a copy of the original dataset
df_crew= df_title_crew.copy()

# Delete 'writers' 
df_crew.drop(['writers'], axis=1, inplace=True)

# Drop missing values in 'directors'
df_crew.dropna(axis=0, subset=['directors'], inplace=True)

# Drop duplicate in 'tconst', film id
df_crew.drop_duplicates(subset='tconst', inplace=True)

df_crew.head()

      tconst                      directors
0  tt0285252                      nm0899854
2  tt0462036                      nm1940585
3  tt0835418                      nm0151540
4  tt0878654  nm0089502,nm2291498,nm2292011
5  tt0879859                      nm2416460

In [5]:
# Count how many directors in each cell. 

# Create a new data frame with split directors columns 
directors = df_crew['directors'].str.split(',', expand =True)
 
directors.info()

# Most films has only one or two directors. 
# For this project, drop films with 4 or more directors

<class 'pandas.core.frame.DataFrame'>
Int64Index: 140417 entries, 0 to 146142
Data columns (total 83 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       140417 non-null  object
 1   1       15727 non-null   object
 2   2       2501 non-null    object
 3   3       1090 non-null    object
 4   4       710 non-null     object
 5   5       517 non-null     object
 6   6       401 non-null     object
 7   7       321 non-null     object
 8   8       258 non-null     object
 9   9       206 non-null     object
 10  10      139 non-null     object
 11  11      112 non-null     object
 12  12      92 non-null      object
 13  13      77 non-null      object
 14  14      69 non-null      object
 15  15      65 non-null      object
 16  16      60 non-null      object
 17  17      58 non-null      object
 18  18      53 non-null      object
 19  19      50 non-null      object
 20  20      43 non-null      object
 21  21      39 non-null      object
 22  22      37 non-null      object
 23  23      35 non-null      object
 24  24      33 non-null      object
 25  25      32 non-null      object
 26  26      28 non-null      object
 27  27      26 non-null      object
 28  28      24 non-null      object
 29  29      22 non-null      object
 30  30      20 non-null      object
 31  31      16 non-null      object
 32  32      14 non-null      object
 33  33      13 non-null      object
 34  34      11 non-null      object
 35  35      11 non-null      object
 36  36      11 non-null      object
 37  37      11 non-null      object
 38  38      11 non-null      object
 39  39      10 non-null      object
 40  40      9 non-null       object
 41  41      8 non-null       object
 42  42      8 non-null       object
 43  43      8 non-null       object
 44  44      8 non-null       object
 45  45      8 non-null       object
 46  46      7 non-null       object
 47  47      7 non-null       object
 48  48      6 non-null       object
 49  49      6 non-null       object
 50  50      6 non-null       object
 51  51      5 non-null       object
 52  52      5 non-null       object
 53  53      5 non-null       object
 54  54      5 non-null       object
 55  55      5 non-null       object
 56  56      5 non-null       object
 57  57      5 non-null       object
 58  58      5 non-null       object
 59  59      4 non-null       object
 60  60      4 non-null       object
 61  61      3 non-null       object
 62  62      3 non-null       object
 63  63      2 non-null       object
 64  64      2 non-null       object
 65  65      2 non-null       object
 66  66      2 non-null       object
 67  67      2 non-null       object
 68  68      2 non-null       object
 69  69      2 non-null       object
 70  70      2 non-null       object
 71  71      2 non-null       object
 72  72      2 non-null       object
 73  73      1 non-null       object
 74  74      1 non-null       object
 75  75      1 non-null       object
 76  76      1 non-null       object
 77  77      1 non-null       object
 78  78      1 non-null       object
 79  79      1 non-null       object
 80  80      1 non-null       object
 81  81      1 non-null       object
 82  82      1 non-null       object
dtypes: object(83)
memory usage: 90.0+ MB

In [6]:
# Drop films with 4 or more directors 

# Step 1 - split directors into director1, director2, director3, director4 
# 'director4' has 4th and above directors
df_crew[['director1', 'director2', 'director3', 'director4']] = df_crew['directors'].str.split(',', n=3,  expand =True)

# Step 2 - drop rows which 'director4' is not null.
df_crew.dropna(axis=0, subset=['director4'])

# Step 3 - drop 'directors' and 'director4' columns. 
df_crew.drop(['directors', 'director4'], axis=1, inplace=True)

df_crew.sample(20)

           tconst  director1  director2 director3
104313  tt2814502  nm0602128       None      None
134230  tt3244892  nm6001895       None      None
74383   tt8350902  nm2920652       None      None
78309   tt4457256  nm0055348       None      None
78000   tt3593666  nm0453003       None      None
64151   tt6146394  nm0233370       None      None
58810   tt5096246  nm2251279       None      None
81531   tt7385632  nm6810308       None      None
109387  tt3045010  nm5795320  nm5795321      None
128389  tt1658842  nm3921032       None      None
24031   tt0470752  nm0307497       None      None
125207  tt7088504  nm8030649       None      None
51004   tt5904624  nm4529114       None      None
35643   tt4921916  nm8035150       None      None
129310  tt4278446  nm4986863       None      None
59695   tt7507466  nm4364495  nm4832880      None
110500  tt5496754  nm2243359       None      None
76403   tt6839248  nm1712317  nm8958833      None
107207  tt3681526  nm1242534       None      None
91495   tt8098548  nm5959317       None      None

### Step 2: Clearning imdb.name.basics

In [7]:
df_name = pd.read_csv('Data/zippedData/imdb.name.basics.csv.gz')
df_name.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

In [8]:
df_name.sample(5)

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
145612,nm2643703,Félix Koch,1980.0,NaN,"director,writer,visual_effects","tt2486046,tt9185526,tt2767884,tt1024843"
217488,nm2177247,Justin B. Wilson,NaN,NaN,"camera_department,actor,assistant_director","tt0762127,tt1262892,tt0337899,tt1648062"
595409,nm6934880,Ohad Ofaz,NaN,NaN,writer,tt2841672
575842,nm7739047,Papa Surname,NaN,NaN,NaN,tt5127076
197725,nm1501940,Petar Bakic,NaN,NaN,"camera_department,cinematographer","tt2160915,tt8489558,tt4671306,tt3188768"

In [9]:
# Keep 'nconst', 'primary_name'
df_name2 = df_name[['nconst', 'primary_name' ]]

df_name2

           nconst         primary_name
0       nm0061671    Mary Ellen Bauder
1       nm0061865         Joseph Bauer
2       nm0062070           Bruce Baum
3       nm0062195         Axel Baumann
4       nm0062798          Pete Baxter
...           ...                  ...
606643  nm9990381         Susan Grobes
606644  nm9990690          Joo Yeon So
606645  nm9991320       Madeline Smith
606646  nm9991786  Michelle Modigliani
606647  nm9993380       Pegasus Envoyé

[606648 rows x 2 columns]

### Step 3: Merge director ids (in df_crew) and director names (in df_name2)

In [10]:
# Merge names of directors for director1, and rename it director_name1  

df_merge1 = df_crew.merge(df_name2, how='left', left_on='director1', right_on='nconst' )

# Rename
df_merge1.rename(columns={'primary_name':'director_name1'}, inplace=True)

# drop keys
df_merge1.drop(axis=1, columns='nconst', inplace=True)

df_merge1.head(2)

      tconst  director1 director2 director3 director_name1
0  tt0285252  nm0899854      None      None    Tony Vitale
1  tt0462036  nm1940585      None      None     Bill Haley

In [11]:
# Merge names of directors for director2, and rename it director_name2  
df_merge2 = df_merge1.merge(df_name2, how='left', left_on='director2', right_on='nconst' )

# Rename
df_merge2.rename(columns={'primary_name':'director_name2'}, inplace=True)

# drop keys
df_merge2.drop(axis=1, columns='nconst', inplace=True)

df_merge2.head(2)

      tconst  director1 director2 director3 director_name1 director_name2
0  tt0285252  nm0899854      None      None    Tony Vitale            NaN
1  tt0462036  nm1940585      None      None     Bill Haley            NaN

In [12]:
# Merge names of directors for director3, and rename it director_name3

df_merge3 = df_merge2.merge(df_name2, how='left', left_on='director2', right_on='nconst' )

# Rename
df_merge3.rename(columns={'primary_name':'director_name3'}, inplace=True)

# drop keys
df_merge3.drop(axis=1, columns='nconst', inplace=True)

df_merge3.head(2)

,tconst,director1,director2,director3,director_name1,director_name2,director_name3
0,tt0285252,nm0899854,None,None,Tony Vitale,NaN,NaN
1,tt0462036,nm1940585,None,None,Bill Haley,NaN,NaN

### Clean dataset in a wide format

In [13]:
df_directors_wide = df_merge3
df_directors_wide.head(3)

,tconst,director1,director2,director3,director_name1,director_name2,director_name3
0,tt0285252,nm0899854,None,None,Tony Vitale,NaN,NaN
1,tt0462036,nm1940585,None,None,Bill Haley,NaN,NaN
2,tt0835418,nm0151540,None,None,Jay Chandrasekhar,NaN,NaN

### Reshape from wide to long format

In [14]:
## reshape wide to long format 
df_directors_long = pd.wide_to_long(df_directors_wide, ["director", "director_name"], i='tconst', j='n_th_director' )


# Drop NaN in 'director'
df_directors_long.dropna(axis=0, subset=['director'], inplace=True)

df_directors_long.reset_index(inplace=True)

# Delete 'n_th_director' 

df_directors_long.drop('n_th_director', axis=1, inplace=True)

### Clean dataset in a long format

In [15]:
df_directors_long.head()

      tconst   director      director_name
0  tt0285252  nm0899854        Tony Vitale
1  tt0462036  nm1940585         Bill Haley
2  tt0835418  nm0151540  Jay Chandrasekhar
3  tt0878654  nm0089502        Albert Pyun
4  tt0879859  nm2416460    Eric Manchester

In [16]:
#number of films shot by directors 

df_directors_long['director_name'].value_counts()[:20]

Omer Pasha                   62
Larry Rosen                  51
Rajiv Chilaka                50
Stephan Düfel                48
Graeme Duane                 45
Gérard Courant               44
Claudio Costa                42
Nayato Fio Nuala             41
Eckhart Schmidt              37
Sergey A.                    36
Tetsuya Takehora             33
Michael Fredianelli          32
Charlie Minn                 30
Dustin Ferguson              29
Paul T.T. Easter             28
William Winckler             27
Philip Gardiner              27
Manny Velazquez              27
Yoshikazu Katô               27
Narinderpal Singh Chandok    26
Name: director_name, dtype: int64

### Merging mdb.title.ratings

In [17]:
df_title_rating = pd.read_csv('Data/zippedData/imdb.title.ratings.csv.gz')
df_title_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [18]:
# drop 'numvotes'
df_title_rating.drop(axis=1, columns = 'numvotes', inplace=True)

In [19]:
# Merge imdb.title.ratings and emiko's df_directors_wide 

df_directors_ratings = df_title_rating.merge(df_directors_wide, how='inner', on='tconst' )

In [20]:
df_directors_ratings.head(3)

,tconst,averagerating,director1,director2,director3,director_name1,director_name2,director_name3
0,tt10356526,8.3,nm8353804,None,None,Sukh Sanghera,NaN,NaN
1,tt10384606,8.9,nm9932562,nm9250842,None,George Llewelyn-John,Caolan Robertson,Caolan Robertson
2,tt1042974,6.4,nm1915232,None,None,Marcel Grant,NaN,NaN

### Merge Piotr data to df_directors_ratings

In [21]:
df_title_basic = pd.read_csv('Data/zippedData/imdb.title.basics.csv.gz')
df_title_basic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [22]:
df_title_basic

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [23]:
df_title_basic.dropna(inplace = True)

In [24]:
df_title_basic

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
...,...,...,...,...,...,...
146134,tt9916160,Drømmeland,Drømmeland,2019,72.0,Documentary
146135,tt9916170,The Rehearsal,O Ensaio,2019,51.0,Drama
146136,tt9916186,Illenau - die Geschichte einer ehemaligen Heil...,Illenau - die Geschichte einer ehemaligen Heil...,2017,84.0,Documentary
146137,tt9916190,Safeguard,Safeguard,2019,90.0,"Drama,Thriller"
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama

In [25]:
df_year = df_title_basic[df_title_basic["start_year"] >= 2010]

In [26]:
df_year["start_year"].value_counts()

2016    13253
2017    13240
2015    12965
2014    12693
2013    12070
2018    12055
2012    11180
2011    10462
2010     9793
2019     4433
2020       81
2021        4
2022        3
Name: start_year, dtype: int64

In [27]:
df_year.drop("original_title", axis=1, inplace=True)

In [28]:
df_year

,tconst,primary_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,2018,122.0,Drama
4,tt0100275,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,2018,75.0,Comedy
...,...,...,...,...,...
146134,tt9916160,Drømmeland,2019,72.0,Documentary
146135,tt9916170,The Rehearsal,2019,51.0,Drama
146136,tt9916186,Illenau - die Geschichte einer ehemaligen Heil...,2017,84.0,Documentary
146137,tt9916190,Safeguard,2019,90.0,"Drama,Thriller"
146139,tt9916538,Kuambil Lagi Hatiku,2019,123.0,Drama

In [29]:
# Merge piotr's df_year and emiko's df_directors_wide 

df_imdb = df_year.merge(df_directors_ratings, how='inner', on='tconst' )

In [32]:
df_imdb.head()

,tconst,primary_title,start_year,runtime_minutes,genres,averagerating,director1,director2,director3,director_name1,director_name2,director_name3
0,tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,nm0712540,None,None,Harnam Singh Rawail,NaN,NaN
1,tt0066787,One Day Before the Rainy Season,2019,114.0,"Biography,Drama",7.2,nm0002411,None,None,Mani Kaul,NaN,NaN
2,tt0069049,The Other Side of the Wind,2018,122.0,Drama,6.9,nm0000080,None,None,Orson Welles,NaN,NaN
3,tt0100275,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy",6.5,nm0765384,nm0749914,None,Valeria Sarmiento,Raoul Ruiz,Raoul Ruiz
4,tt0137204,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy",8.1,nm0365480,None,None,Anthony Harrison,NaN,NaN

In [33]:
df_imdb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65305 entries, 0 to 65304
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   tconst           65305 non-null  object
 1   primary_title    65305 non-null  object
 2   start_year       65305 non-null  int64
 3   runtime_minutes  65305 non-null  float64
 4   genres           65305 non-null  object
 5   averagerating    65305 non-null  float64
 6   director1        65305 non-null  object
 7   director2        7256 non-null   object
 8   director3        1195 non-null   object
 9   director_name1   65304 non-null  object
 10  director_name2   7256 non-null   object
 11  director_name3   7256 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 6.5+ MB